Tekla Open API Reference for Tekla Structures 2025
ImageComboBox Class
Note: This API is now obsolete.
 The ImageComboBox class represents a combo box control that can contain images.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ImageComboBox
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use the new ImageListComboBox control.")]
public class ImageComboBox : UserControl
<ObsoleteAttribute("Use the new ImageListComboBox control.")>
Public Class ImageComboBox
	Inherits UserControl
The ImageComboBox type exposes the following members.
Constructors
Name | Description
ImageComboBox
 Initializes a new instance of the ImageComboBox class.
Top
Properties
Name | Description
DefaultValue
 Gets or sets the default value in the image combo box.
OptionList
 Gets or sets the elements of the option list, the images that are in the image combo box.
SelectedIndex
 Gets or sets the selected index of the image in the image combo box.
SelectedItem
 Gets or sets the selected image in the image combo box.
Top
Events
Name | Description
ImageCBSelectedIndexChanged
 The ImageCBSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace